In [1]:
import pandas as pd
import numpy as np

In [2]:
#Read the csv file:
df = pd.read_csv("D:\Dataset files_ML\Chi-Square Test/Netflix Userbase.csv")

In [3]:
df

,User ID,Subscription Type,Monthly Revenue,Join Date,Last Payment Date,Country,Age,Gender,Device,Plan Duration
0,1,Basic,10,15-01-22,10-06-23,United States,28,Male,Smartphone,1 Month
1,2,Premium,15,05-09-21,22-06-23,Canada,35,Female,Tablet,1 Month
2,3,Standard,12,28-02-23,27-06-23,United Kingdom,42,Male,Smart TV,1 Month
3,4,Standard,12,10-07-22,26-06-23,Australia,51,Female,Laptop,1 Month
4,5,Basic,10,01-05-23,28-06-23,Germany,33,Male,Smartphone,1 Month
...,...,...,...,...,...,...,...,...,...,...
2495,2496,Premium,14,25-07-22,12-07-23,Spain,28,Female,Smart TV,1 Month
2496,2497,Basic,15,04-08-22,14-07-23,Spain,33,Female,Smart TV,1 Month
2497,2498,Standard,12,09-08-22,15-07-23,United States,38,Male,Laptop,1 Month
2498,2499,Standard,13,12-08-22,12-07-23,Canada,48,Female,Tablet,1 Month
2499,2500,Basic,15,13-08-22,12-07-23,United States,35,Female,Smart TV,1 Month

In [4]:
pd.crosstab(df["Subscription Type"], df["Device"])

Device             Laptop  Smart TV  Smartphone  Tablet
Subscription Type
Basic                 259       238         251     251
Premium               192       188         171     182
Standard              185       184         199     200

In [5]:
sub_type = pd.crosstab(df["Subscription Type"], df["Device"])

In [6]:
sub_type

Device             Laptop  Smart TV  Smartphone  Tablet
Subscription Type
Basic                 259       238         251     251
Premium               192       188         171     182
Standard              185       184         199     200

In [7]:
basic_sum = sub_type.loc["Basic"].sum()
basic_sum

999

In [8]:
premium_sum = sub_type.loc["Premium"].sum()
premium_sum

733

In [9]:
standard_sum = sub_type.loc["Standard"].sum()
standard_sum

768

In [10]:
laptop_sum = sub_type["Laptop"].sum()
laptop_sum

636

In [11]:
smart_tv_sum = sub_type["Smart TV"].sum()
smart_tv_sum

610

In [12]:
smartphone_sum = sub_type["Smartphone"].sum()
smartphone_sum

621

In [13]:
tablet_sum = sub_type["Tablet"].sum()
tablet_sum

633

In [14]:
grand_total = sub_type.sum().sum()

In [15]:
grand_total

2500

In [16]:
cols_name = sub_type.columns.to_list()
cols_name

['Laptop', 'Smart TV', 'Smartphone', 'Tablet']

In [17]:
rows_name = sub_type.index.to_list()
rows_name

['Basic', 'Premium', 'Standard']

In [18]:
a =[]
for i in rows_name:
    exp_values = []
    for j in cols_name:
        exp_values.append((sub_type.loc[i].sum() * sub_type[j].sum()) / grand_total)
    a.append(exp_values)

In [19]:
exp_values

[195.3792, 187.392, 190.7712, 194.4576]

In [20]:
a

[[254.1456, 243.756, 248.1516, 252.9468],
 [186.4752, 178.852, 182.0772, 185.5956],
 [195.3792, 187.392, 190.7712, 194.4576]]

In [21]:
sub_type

Device             Laptop  Smart TV  Smartphone  Tablet
Subscription Type
Basic                 259       238         251     251
Premium               192       188         171     182
Standard              185       184         199     200

In [22]:
b = np.array(sub_type)

In [23]:
b

array([[259, 238, 251, 251],
       [192, 188, 171, 182],
       [185, 184, 199, 200]], dtype=int64)

In [24]:
#To calculate the p_value:
p_value = np.sum((b-a)**2/a)

In [25]:
p_value

2.7771773735944496

So,
H0(null hypothesis) = subcription type and device columns are independent
Ha(Alternate hypothesis) = subcription type and device are dependent

Degree of fredom = (rows-1)*(cols-1) = (3-1)*(4-1) = 2*3 = 6

alpha for 95% with DOF of 6 is = 12.592    #See in chi square table 95% with DOF
p_value = 2.7771

conclusion that, p_value is less than alpha   (p_value < alpha)
Hence, Null hypothesis(H0) is accepted and
       Alternate hypothesis(Ha) is rejected
    
subcription type and device columns are independent:

In [26]:
b.sum()

2500

In [27]:
(b[0].sum() * b[:,0].sum()) / b.sum()

254.1456

In [28]:
np.array([[(b[i].sum() * b[:,j].sum()) / b.sum() for i in range(b.shape[0])] for j in range(b.shape[1])]).T

array([[254.1456, 243.756 , 248.1516, 252.9468],
       [186.4752, 178.852 , 182.0772, 185.5956],
       [195.3792, 187.392 , 190.7712, 194.4576]])

In [90]:
def chi_square(df, col1, col2):
    new_df = pd.crosstab(df[col1], df[col2])
    obs = np.array(new_df)
    exp = np.array([[(obs[i].sum()*obs[:,j].sum())/obs.sum() for i in range(obs.shape[0])] for j in range(obs.shape[1])]).T
    return np.sum((obs-exp)**2/exp)

In [91]:
df.head()

,User ID,Subscription Type,Monthly Revenue,Join Date,Last Payment Date,Country,Age,Gender,Device,Plan Duration
0,1,Basic,10,15-01-22,10-06-23,United States,28,Male,Smartphone,1 Month
1,2,Premium,15,05-09-21,22-06-23,Canada,35,Female,Tablet,1 Month
2,3,Standard,12,28-02-23,27-06-23,United Kingdom,42,Male,Smart TV,1 Month
3,4,Standard,12,10-07-22,26-06-23,Australia,51,Female,Laptop,1 Month
4,5,Basic,10,01-05-23,28-06-23,Germany,33,Male,Smartphone,1 Month

In [92]:
chi_square(df, "Subscription Type", "Gender")

0.6282267388216123

In [94]:
#subscription type is = 3:
#Gender is only = 2

(3-1)*(2-1)

2

In [95]:
obs = pd.crosstab(df["Subscription Type"], df["Gender"])

In [96]:
obs = np.array(obs)

In [97]:
obs.shape

(3, 2)

In [98]:
[[(obs[i].sum()*obs[:,j].sum())/obs.sum() for i in range(obs.shape[0])] for j in range(obs.shape[1])]

[[502.2972, 368.5524, 386.1504], [496.7028, 364.4476, 381.8496]]

In [100]:
obs[0].sum()

999

In [101]:
sum([502.2972, 496.7028])

999.0

In [102]:
sum([502.2972, 368.5524, 386.1504])

1257.0

In [103]:
obs.sum()

2500

In [104]:
(999.0*1257.0)/2500

502.2972

In [105]:
df.head(3)

,User ID,Subscription Type,Monthly Revenue,Join Date,Last Payment Date,Country,Age,Gender,Device,Plan Duration
0,1,Basic,10,15-01-22,10-06-23,United States,28,Male,Smartphone,1 Month
1,2,Premium,15,05-09-21,22-06-23,Canada,35,Female,Tablet,1 Month
2,3,Standard,12,28-02-23,27-06-23,United Kingdom,42,Male,Smart TV,1 Month

In [106]:
chi_square(df, "Device", "Gender")

1.6597858901627875

In [108]:
a = np.array(["A", "B", "C", "A", "B", "C", "A", "B", "C"])
b = np.array(["x", "y", "z", "x", "z", "y", "x", "y", "z"])

In [109]:
a

array(['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C'], dtype='<U1')

In [110]:
b

array(['x', 'y', 'z', 'x', 'z', 'y', 'x', 'y', 'z'], dtype='<U1')

In [111]:
df1 = pd.DataFrame({"col1":a, "col2":b})

In [112]:
df1

  col1 col2
0    A    x
1    B    y
2    C    z
3    A    x
4    B    z
5    C    y
6    A    x
7    B    y
8    C    z

In [115]:
chi_square(df1, "col1", "col2")

10.0

In [116]:
pd.crosstab(df1["col1"], df1["col2"])

col2  x  y  z
col1
A     3  0  0
B     0  2  1
C     0  1  2

In [117]:
#Degree of fredom(Dof):
#(row-1)*(col-1)

(3-1)*(3-1)

4

H0 = col1 and col2 are independent 
ha = col1 and col2 are dependent 

alpha of 95% with 4 DOF is = 9.488

p_value > alpha
Hance, null hypothesis is rejected 

col1 and col2 are dependent